In [1]:
import numpy as np 
import pandas as pd

In [2]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
          ('Texas', 2000),('Texas', 2010)]
                                
Populations = [23444456, 44444442,
                13222224, 32226556,
                21114343, 44432323]
pop = pd.Series(Populations, index = index)
pop

(California, 2000)    23444456
(California, 2010)    44444442
(New York, 2000)      13222224
(New York, 2010)      32226556
(Texas, 2000)         21114343
(Texas, 2010)         44432323
dtype: int64

In [3]:
pop[('California', 2010):('Texas', 2000)]

(California, 2010)    44444442
(New York, 2000)      13222224
(New York, 2010)      32226556
(Texas, 2000)         21114343
dtype: int64

In [4]:
pop[[i for i in pop.index if i[1]==2010]]

(California, 2010)    44444442
(New York, 2010)      32226556
(Texas, 2010)         44432323
dtype: int64

In [5]:
#using pandas multi index

index = pd.MultiIndex.from_tuples(index)
index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [6]:
pop = pop.reindex(index)
pop

California  2000    23444456
            2010    44444442
New York    2000    13222224
            2010    32226556
Texas       2000    21114343
            2010    44432323
dtype: int64

In [7]:
pop [:, 2000] # slicing operation for year 2000

California    23444456
New York      13222224
Texas         21114343
dtype: int64

In [8]:
pop [:, 2010] # slicing operation for year 2010

California    44444442
New York      32226556
Texas         44432323
dtype: int64

In [9]:
pop_df = pop.unstack()
pop_df

                2000      2010
California  23444456  44444442
New York    13222224  32226556
Texas       21114343  44432323

In [10]:
pop_df.stack()

California  2000    23444456
            2010    44444442
New York    2000    13222224
            2010    32226556
Texas       2000    21114343
            2010    44432323
dtype: int64

In [11]:
pop_df = pd.DataFrame({'total': pop,
                      'under 18':[2545258, 4125367,
                                  4141414, 3231235,
                                  6565651, 3254125]})
pop_df

                    total  under 18
California 2000  23444456   2545258
           2010  44444442   4125367
New York   2000  13222224   4141414
           2010  32226556   3231235
Texas      2000  21114343   6565651
           2010  44432323   3254125

In [12]:
new_df = pop_df.unstack()

In [13]:
new_df

               total           under 18
                2000      2010     2000     2010
California  23444456  44444442  2545258  4125367
New York    13222224  32226556  4141414  3231235
Texas       21114343  44432323  6565651  3254125

In [14]:
pop_df.stack()

California  2000  total       23444456
                  under 18     2545258
            2010  total       44444442
                  under 18     4125367
New York    2000  total       13222224
                  under 18     4141414
            2010  total       32226556
                  under 18     3231235
Texas       2000  total       21114343
                  under 18     6565651
            2010  total       44432323
                  under 18     3254125
dtype: int64

In [15]:
new_df.stack()

                    total  under 18
California 2000  23444456   2545258
           2010  44444442   4125367
New York   2000  13222224   4141414
           2010  32226556   3231235
Texas      2000  21114343   6565651
           2010  44432323   3254125

In [16]:
f_u18 = pop_df['under 18']/pop_df['total']
f_u18

California  2000    0.108565
            2010    0.092821
New York    2000    0.313216
            2010    0.100266
Texas       2000    0.310957
            2010    0.073238
dtype: float64

In [17]:
f_u18.unstack()

                2000      2010
California  0.108565  0.092821
New York    0.313216  0.100266
Texas       0.310957  0.073238

In [18]:
df = pd.DataFrame(np.random.rand(4, 2),
                 index = [['a', 'a', 'b', 'b'], ['1', '2', '1', '2']],
                 columns = ['data1', 'data2'])
df

        data1     data2
a 1  0.732378  0.836650
  2  0.891337  0.323515
b 1  0.977370  0.035849
  2  0.517101  0.573256

In [19]:
data = {('California', 2000): 2523214,
        ('California', 2010): 5252456,
        ('Texas', 2000): 1425367,
        ('Texas', 2010): 5255367,
        ('New York', 2000): 4325367,
        ('New York', 2010): 6525367}
pd.Series (data)

California  2000    2523214
            2010    5252456
Texas       2000    1425367
            2010    5255367
New York    2000    4325367
            2010    6525367
dtype: int64

In [20]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [21]:
pd.MultiIndex.from_tuples ([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [22]:
pd.MultiIndex.from_product([['a', 'b'], [1, 2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [23]:
pd.MultiIndex(levels =[['a', 'b'], [1, 2]],
             labels = [[0, 0, 1, 1], [0, 1, 0, 1]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [24]:
pop.index.names = ['state', 'year']
pop

state       year
California  2000    23444456
            2010    44444442
New York    2000    13222224
            2010    32226556
Texas       2000    21114343
            2010    44432323
dtype: int64

In [25]:
# hierarchial indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                  names= ['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                    names =['subject', 'type'])

In [26]:
# mock some data
data =np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

In [27]:
# create the dtaframe
health_data =pd.DataFrame(data, index = index, columns = columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      42.0  34.8  41.0  37.1  30.0  36.9
     2      60.0  36.0  57.0  37.2  32.0  37.2
2014 1      39.0  37.1  58.0  37.7  17.0  36.6
     2      52.0  37.5  17.0  36.9  31.0  37.2

In [28]:
health_data ["Sue"]

type          HR  Temp
year visit
2013 1      30.0  36.9
     2      32.0  37.2
2014 1      17.0  36.6
     2      31.0  37.2

In [29]:
pop

state       year
California  2000    23444456
            2010    44444442
New York    2000    13222224
            2010    32226556
Texas       2000    21114343
            2010    44432323
dtype: int64

In [30]:
pop.loc['California': 'New York']

state       year
California  2000    23444456
            2010    44444442
New York    2000    13222224
            2010    32226556
dtype: int64

In [31]:
pop [:, 2000]

state
California    23444456
New York      13222224
Texas         21114343
dtype: int64

In [32]:
pop[pop > 30000000]

state       year
California  2010    44444442
New York    2010    32226556
Texas       2010    44432323
dtype: int64

In [33]:
pop [['California', 'Texas']]

state       year
California  2000    23444456
            2010    44444442
Texas       2000    21114343
            2010    44432323
dtype: int64

In [34]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      42.0  34.8  41.0  37.1  30.0  36.9
     2      60.0  36.0  57.0  37.2  32.0  37.2
2014 1      39.0  37.1  58.0  37.7  17.0  36.6
     2      52.0  37.5  17.0  36.9  31.0  37.2

In [35]:
health_data['Bob', 'HR']

year  visit
2013  1        42.0
      2        60.0
2014  1        39.0
      2        52.0
Name: (Bob, HR), dtype: float64

In [36]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      42.0  34.8
     2      60.0  36.0

In [37]:
health_data.loc[ :,('Bob', 'HR')]

year  visit
2013  1        42.0
      2        60.0
2014  1        39.0
      2        52.0
Name: (Bob, HR), dtype: float64

In [38]:
idx = pd.IndexSlice
health_data.loc[idx[:, :2], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      42.0  41.0  30.0
     2      60.0  57.0  32.0
2014 1      39.0  58.0  17.0
     2      52.0  17.0  31.0

In [39]:
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data = pd.Series(np.random.rand(6), index = index)
data.index.names =['char', 'int']
data

char  int
a     1      0.419038
      2      0.881396
c     1      0.222023
      2      0.032200
b     1      0.533018
      2      0.916546
dtype: float64

In [40]:
try:
  data['a':'b']
except KeyError as e:
    print (type(e))
    print (e)

<class 'pandas.errors.UnsortedIndexError'>
'Key length (1) was greater than MultiIndex lexsort depth (0)'

In [41]:
data = data.sort_index()
data

char  int
a     1      0.419038
      2      0.881396
b     1      0.533018
      2      0.916546
c     1      0.222023
      2      0.032200
dtype: float64

In [42]:
data = data.sortlevel()
data

C:\Users\Mannawar Hussain\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level=...)
  """Entry point for launching an IPython kernel.

char  int
a     1      0.419038
      2      0.881396
b     1      0.533018
      2      0.916546
c     1      0.222023
      2      0.032200
dtype: float64

In [43]:
data ['a':'b']

char  int
a     1      0.419038
      2      0.881396
b     1      0.533018
      2      0.916546
dtype: float64

In [44]:
pop.unstack(level = 0)

state  California  New York     Texas
year
2000     23444456  13222224  21114343
2010     44444442  32226556  44432323

In [45]:
pop.unstack(level = 1)

year            2000      2010
state
California  23444456  44444442
New York    13222224  32226556
Texas       21114343  44432323

In [46]:
pop.unstack().stack()

state       year
California  2000    23444456
            2010    44444442
New York    2000    13222224
            2010    32226556
Texas       2000    21114343
            2010    44432323
dtype: int64

In [47]:
pop_flat= pop.reset_index(name ='population')
pop_flat

        state  year  population
0  California  2000    23444456
1  California  2010    44444442
2    New York  2000    13222224
3    New York  2010    32226556
4       Texas  2000    21114343
5       Texas  2010    44432323

In [48]:
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    23444456
           2010    44444442
New York   2000    13222224
           2010    32226556
Texas      2000    21114343
           2010    44432323

In [49]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      42.0  34.8  41.0  37.1  30.0  36.9
     2      60.0  36.0  57.0  37.2  32.0  37.2
2014 1      39.0  37.1  58.0  37.7  17.0  36.6
     2      52.0  37.5  17.0  36.9  31.0  37.2

In [50]:
data_mean_visit =health_data.mean(level = 'visit')

In [51]:
data_mean_visit

subject   Bob        Guido          Sue
type       HR   Temp    HR   Temp    HR   Temp
visit
1        40.5  35.95  49.5  37.40  23.5  36.75
2        56.0  36.75  37.0  37.05  31.5  37.20

In [52]:
data_mean_year = health_data.mean(level = 'year')
data_mean_year

subject   Bob       Guido          Sue
type       HR  Temp    HR   Temp    HR   Temp
year
2013     51.0  35.4  49.0  37.15  31.0  37.05
2014     45.5  37.3  37.5  37.30  24.0  36.90

In [53]:
mean_data_temp_HR = health_data.mean(axis = 1, level= 'type')
mean_data_temp_HR

type               HR       Temp
year visit
2013 1      37.666667  36.266667
     2      49.666667  36.800000
2014 1      38.000000  37.133333
     2      33.333333  37.200000

In [54]:
data_mean_year.mean(axis=1, level='type')

type         HR       Temp
year
2013  43.666667  36.533333
2014  35.666667  37.166667

In [55]:
def make_df (cols, ind):
    data ={c:[str(c) + str(i) for i in ind] 
           for c in cols}
    return pd.DataFrame (data, ind)

In [56]:
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [57]:
ser1 = pd.Series(['A', 'B', 'C'], index = [1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index = [4, 5, 6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [58]:
ser1 = pd.Series(['A', 'B', 'C'], index = [1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index = [4, 5, 6])
pd.concat([ser1, ser2], axis = 0)

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [59]:
ser1 = pd.Series(['A', 'B', 'C'], index = [1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index = [4, 5, 6])
pd.concat([ser1, ser2], axis = 1)

     0    1
1    A  NaN
2    B  NaN
3    C  NaN
4  NaN    D
5  NaN    E
6  NaN    F

In [60]:
df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])
print (df1); print (df2); print (pd.concat([df1, df2], axis =1)) # axis =0 (across column), axis = 1 (across row)

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
     A    B    A    B
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3  NaN  NaN   A3   B3
4  NaN  NaN   A4   B4

In [61]:
x = make_df('AB', [0, 1] )
y = make_df ('AB', [2, 3])

In [62]:
y.index = x.index
print (x); print (y); print (pd.concat([x,y]))

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3
    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

In [63]:
pd.concat([x, y], verify_integrity = True)

ValueError: Indexes have overlapping values: Int64Index([0, 1], dtype='int64')

In [ ]:
try:
    pd.concat([x, y], verify_integrity = True)
except ValueError as e:
 print ("ValueError:", e)

In [ ]:
print (x); print (y); print(pd.concat([x, y], ignore_index= True))

In [ ]:
print (x); print (y); print (pd.concat([x, y], keys = ['x', 'y']))

In [64]:
df5 = make_df ('ABC', [1, 2])
df6 = make_df ('BCD', [3, 4])
print (df5); print (df6); print (pd.concat([df5, df6]))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

C:\Users\Mannawar Hussain\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  This is separate from the ipykernel package so we can avoid doing imports until

In [68]:
print (pd.concat([df5, df6], join = 'inner'))

    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

In [69]:
print (pd.concat([df5, df6], join = 'outer'))

     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

C:\Users\Mannawar Hussain\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [83]:
print (df5); print (df6)

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4

In [84]:
print (pd.concat([df5, df6], join_axes = [df5.columns]))

     A   B   C
1   A1  B1  C1
2   A2  B2  C2
3  NaN  B3  C3
4  NaN  B4  C4

In [85]:
print (df1.append(df2))

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [86]:
print (df5.append(df6))

     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

C:\Users\Mannawar Hussain\Anaconda3\lib\site-packages\pandas\core\frame.py:6211: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)